Revit 2027 API
FilterElementIdRule Class
 A filter rule that operates on ElementId values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterElementIdRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterElementIdRule : FilterNumericValueRule
Public Class FilterElementIdRule
	Inherits FilterNumericValueRule
public ref class FilterElementIdRule : public FilterNumericValueRule
type FilterElementIdRule =
    class
        inherit FilterNumericValueRule
    end
The FilterElementIdRule type exposes the following members.
Constructors
Name | Description
FilterElementIdRule |  Constructs an instance of FilterElementIdRule.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterRule)
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
Methods
Name | Description
Dispose
(Inherited from FilterRule)
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
(Inherited from FilterRule)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEvaluator |  Gets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
(Inherited from FilterRule)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEvaluator |  Sets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
ToString | Returns a string that represents the current object.
(Inherited from Object)
UsesLevelFiltering |  This function checks if a parameter uses level filtering.
Top
Remarks
 When GetRuleParameter() returns a parameter that UsesLevelFiltering(Document, ElementId), then the comparisons will first compare the values of the levels' elevations, then compare the levels' names, and finally the levels' element ids to rank and sort the levels.
See Also
Reference
Autodesk.Revit.DB Namespace